app/Services/NelcXapiService.php

    protected function alreadySent(int $userId, string $verb, string $objectType, ?int $objectId = null, ?int $courseId = null): bool
    {
        return DB::table('nelc_xapi_statements')
            ->where('user_id', $userId)
            ->where('verb', $verb)
            ->where('object_type', $objectType)
            ->where('object_id', $objectId)
            ->where('course_id', $courseId)
            ->exists();
---
select exists(select * from `nelc_xapi_statements` where `user_id` = 1062 and `verb` = 'registered' and `object_type` = 'course' and `object_id` = 2009 and `course_id` = 2009) as `exists`

    protected function recordStatement(int $userId, string $verb, string $objectType, ?int $objectId, ?int $courseId, ?array $response): void
    {
        try {
            DB::table('nelc_xapi_statements')->insert([
                'user_id' => $userId,
                'verb' => $verb,
                'object_type' => $objectType,
                'object_id' => $objectId,
                'course_id' => $courseId,
                'lrs_response_uuid' => $response['body'] ?? null,
                'status_code' => $response['status'] ?? null,
                'sent_at' => now(),
            ]);
---
insert into `nelc_xapi_statements` (`user_id`, `verb`, `object_type`, `object_id`, `course_id`, `lrs_response_uuid`, `status_code`, `sent_at`) values (1062, 'registered', 'course', 2009, 2009, '{\"message\":\"invalid login\"}', 401, '2026-02-25 11:07:52')